{"modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "batch_input_shape": [null, 770], "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 200, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 2, "name": "dense_2", "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "Adagrad", "config": {"epsilon": 1e-07, "lr": 0.009999999776482582, "decay": 0.0}}, "loss": "mean_squared_error", "loss_weights": null}, "keras_version": "2.2.2"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [770, 200], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [200], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [200, 2], "name": "dense_2/kernel", "dtype": "float32"}, {"shape": [2], "name": "dense_2/bias", "dtype": "float32"}]}]}